src/test/resources/requests/GetCityForecastByZIPTest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://www.codecentric.de/namespace/weatherservice/general">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:GetCityForecastByZIP>
         <gen:ZIP>99425</gen:ZIP>
      </gen:GetCityForecastByZIP>
   </soapenv:Body>
</soapenv:Envelope>